[
    {
        "username": "Renata Janssen-Decker",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr. Tamassia’s amazing diagnostic skills have made all the difference for our pets over the years. The hospital is welcoming, highly prepared to deal with any emergency and the staff is well trained to handle pets and people alike. Upon entering the hospital, only a few short hours after its opening, I overheard a customer thank the front desk staff for their kindness and compassion. I cannot recommend Dogwood enough.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxY2epxmcFdJx9az6PcY_IexPnbLYG7pvd9EKbsH=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Josh Mason",
        "rating": "Rated 5.0 out of 5,",
        "review": "We were dog sitting for a friend while they were on vacation and our baby hurt her foot. We weren’t sure where to go as it was late at night. The staff was really awesome here at Dogwood and the location is very new and elegant. We were here for a short time. Ray and Arlicia at the front desk were fantastic and took great care of us. Lisa the Vet Tech was kind and knowledgeable and Dr Corlett was really honest with her diagnosis- she didn’t push treatments that would be more than necessary. Thank you we will definitely be back!!!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QN-UEydgjpkttGHQ84pX7huP8UT8I5xNl6Ublx=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "Gary Vaughan",
        "rating": "Rated 1.0 out of 5,",
        "review": "A but expensive (but what emergency vet is not). I loved the location. Perfectly set up with such nice rooms and so much better than any blue pearl I have been to. The staff and drs are amazing and I’ll def try and use them in an emergency.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Rwlb7wxLNsDh5HHtnjvbF-DUlnkboHOblg9MU7a2k=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "Francesca Moreno",
        "rating": "Rated 5.0 out of 5,",
        "review": "The vet (Dr. Sun), front desk staff and the techs/assistants that my dog and I encountered while at dogwood were all amazing. They were incredibly friendly, compassionate and helpful during our unplanned visit on Christmas Day. While I definitely would have preferred not to spend my Xmas at the emergency vet, they made it not so bad and helped figure out what was going on with my poor puppers.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TboXT7ZBCbE_bPzOf9yzF2gidfrGBEdi6f3QFS1g=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Brynn Bond",
        "rating": "Rated 5.0 out of 5,",
        "review": "Words cannot express my gratitude for all of the staff at this hospital. They saved my dog’s life! The front desk staff is so kind and very professional. The vet techs and doctors are extremely knowledgeable and sweet to my Annie girl. Thank you all at Dogwood for taking care of us. We appreciate all you do for all of the animals.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaYyBfgbeDe4wDLNhlHUZPK_n0TNXUy6k-tN_Eo=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Paula Gonzales",
        "rating": "Rated 5.0 out of 5,",
        "review": "Every single staff personnel we had contact with was super friendly, professional &amp; compassionate about our kitten, Kash. We are so happy we were recommended to go there. The Veterinarian didn't push any service we didn't want and we appreciate the honesty. We will keep taking our furbabies here whenever an emergency arises. Thank y'all for being one of a kind!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RSCJsPYVDufsJsxTH9Bss-krNBhqZxT36gRETNjZk=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "Angela White",
        "rating": "Rated 5.0 out of 5,",
        "review": "Thank you for saving Paloma!\nPaloma was in respiratory distress and Dogwood saved her life!\nFrom the doctors to the techs and receptionist, everyone was concerned and welcoming. We are forever grateful for your exceptional care for our loved one.\nThank you! ❤️",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5S3O6ckYdf9teylcgCfxW8GYeKzSGLG89Gz9jE-rA=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Melissa Perkowski",
        "rating": "Rated 5.0 out of 5,",
        "review": "We have had to take my puppy into Dogwood for 2 separate emergent situations. Most recently, my baby had to be hospitalized on oxygen and IV antibiotics. During his entire stay, the staff was incredibly honest and caring at the same time. They made sure to update me multiple times a day and let us come and visit when it was appropriate. Dr. Shih was absolutely wonderful and provided us with all the answers / education we needed to help with our boy’s recovery and health. Safe to say the staff at Dogwood hands down saved my pup’s life. And we are forever grateful. We will always bring him here in case of another emergency, and would recommend the same for anyone in need of quality, emergent care for their pet. Thank you Dogwood!!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaF8F_zla-ZZV_PRTggIA1pJzTEOMqjpcNaZYbZ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Sabrina Williamson",
        "rating": "Rated 5.0 out of 5,",
        "review": "A new Emergency hospital on Powers Ferry in Marietta in between Delk Road and Terrell Mill. Pure providence that I knew of them.  I took my fur baby there on a recent evening when she was very sick. Turned out she was even more sick than I realized. The front desk staff was so nice and helpful. And the vet techs very caring. The overnight Dr and the critical care Dr were outstanding. They kept me informed of her condition and were just incredibly NICE to work with. They honestly saved her life and I am eternally grateful. If I could give them more stars I would.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZByq7Cdi3trWjVQQNFyBOsREPiOs7WpwaVnCxB=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Christian Payne",
        "rating": "Rated 5.0 out of 5,",
        "review": "I would give them 10 Stars if I was allowed! Very professional staff! They saved my big boys life! They went above and beyond to make sure he was happy and healthy! Thanks again Dogwood Veterinary!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYvAR7N6WTF9r83D-AzHgQHiWcEdQXe-KLoFj8Z=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Kristin",
        "rating": "Rated 1.0 out of 5,",
        "review": "When Molly first saw Dr. Shih, she was one sick little puppy. Through careful attention to her symptoms, appropriate testing, and necessary adjustments to medications, Dr.Shih has found the right balance for her delicate system, so that she is now a happy, healthy 4-year-old.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZtKHSOAhnyta37GLJR2KmDEAaWd4qP43CcNhPF=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Emily Thomas (M.)",
        "rating": "Rated 5.0 out of 5,",
        "review": "We recently went to Dogwood as a result of a medical emergency discovered by our primary veterinarian, and their staff were all incredibly professional. They gave us updates as soon as they had them, were kind over the phone (even the surgeons), and explained every procedure our dog had to undergo as a result of the medical event he was experiencing.\n\nWhile our dog was unable to survive the event (he was a senior large breed dog--10 years old and 80 lbs--and the event was severe), they offered humane euthanasia services, explained why that was the best choice (continued bleeding and clotting) and sent his remains to a crematory who provided pawprint impressions, as a way to memorialize him after his passing.\n\nWhile I'd never recommend someone choose to lose a pet, the staff here was compassionate and understanding, allowing our entire family (including our other pet, who grew up with him in her life) to be in the room when we had to say goodbye.\n\nWhile it is more expensive than your normal veterinarian, this is an emergency vet, so they have surgeons on-call at all hours and are able to provide services outside of the standard business hours of 9-5, so I would still say they're a fantastic option for any emergency pet needs.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5T1JeCBCix4s50fOfMwG9XxDQM3OdJQKSbklQfQCUg=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Kitty Walton",
        "rating": "Rated 5.0 out of 5,",
        "review": "I took my 12 year old Chihuahua LJ into the emergency room on Oct 26th at approximately 9pm with critical respiratory issues as a result of complications from a routine teeth cleaning. They immediately put him on oxygen and gave me a quick evaluation of the situation which saved his life. Dr. Tamassia was absolutely amazing in keeping me calm while taking care of my baby. He was admitted for 2 days during which I called every 4 hours and they answered my questions with compassion and never made me feel like I was calling too often. Thanks to the whole team for saving my baby!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxb-RAnMn8eo-5nlmjoMHQBkfgY3ZjDfBYE2iGc=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Video G",
        "rating": "Rated 5.0 out of 5,",
        "review": "My primary care vet referred me to Dogwood having heard my troubling experiences with the other emergency clinics in Marietta/Atlanta. I can't express enough how grateful i am to Dr. Shih and staff for treatment of my FeLV rescue. This has been the most compassionate and thoughtful hospital in the Atlanta area.  Gypsy and i are eternally grateful. GF - Save Them All, Cat Rescue",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxavYc_QV4B_Vnjxmrf6yUJ-g-QiHU4MFp9CU7Yd=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "Cole Ramsey",
        "rating": "Rated 5.0 out of 5,",
        "review": "Absolutely amazing staff and facility. We had to bring our puppy in for an emergency visit and they were able to get him all squared away with minimal discomfort for him. The doctor was very knowledgeable as to what we needed to do to get our baby better and was very practical in the approach and was just an amazing experience for all things considered. Go here if you have any issues with any babies!!! Dr Shih is the best!!!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbd_s9L_qhnu5ObJILrBKCgussZS726tUS5hkhb=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Allison Hiller",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dogwood was the best place I could have taken my dog in an emergency situation. They took my dog back at a very timely manor and were very kind. The vet explained everything very clearly and sympathetically. They also kept me updated on my dog's condition throughout her whole stay, and they also allow you to call/visit at any point for an update. The office was very clean. I would most definitely recommend this place to anyone, especially to anyone in an emergency situation with their pet.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbVHtn4RKXBWlZfG86xdJ87adgqwbK3RGB3aOtE=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Joshua K",
        "rating": "Rated 5.0 out of 5,",
        "review": "No one wants to need an emergency veterinary service, but if the need should arise the Dr. Shih and the staff of Dogwood are simply amazing.  They took the time to discuss my pet's issues, my treatment options and the plan for ongoing care.  They are incredibly kind and patient with their customers who are dealing with stressful and difficult situations - not all of which have happy endings.  I am so happy we found them and as we continue to work through our own issues I'm comfortable and confident they will remain open, honest and caring to my needs and the needs of my pet.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Q0c76M6l5olKZ5Z417N7ltQRiQVLXSQJG2Ev6C4A=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Anne Mincey",
        "rating": "Rated 5.0 out of 5,",
        "review": "Review of Dogwood Veterinary Specialty and Emergency\n\nI am so grateful for the very positive experience I have had with Dogwood Veterinary Specialty Emergency located at 1234 Powers Ferry Common SE, Marietta Ga 30067, and especially with Dr. Shih a double certified (Critical Care and Anesthesiology/Analgesia) Veterinarian: an incredibly knowledgeable, sensitive, thorough, thoughtful, and caring human being.\nI feel so very fortunate to have been able to get a fast appointment and to have him examine my very ill cat today.\nHe very carefully explained in minute but understandable detail and formulated a plan to treat my cat. I very highly recommend Dogwood – they are locally owned —not ordered around by a huge corporation and they follow their mission “to offer the best veterinary care in the state of Georgia” . They are genuinely focused on helping pets and their owners through very difficult situations. Every staff member I encountered over the phone or in person was caring excellent at their job. I would highly recommend Dogwood Veterinary Specialty Emergency!!! Thank you, Dogwood and Dr. Shih, for the care and expertise you provided for my cat today.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5SpjoZjc8uahkkFrhiaEFamERJwWBOrec3fQucsMA=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Kaitlyn",
        "rating": "Rated 5.0 out of 5,",
        "review": "Unfortunately our puppy had a foreign body obstruction in his intestines (his rope toy was coming apart and he ate some of it so note to others throw away toys right when they start coming apart!). We transferred from another ER vet because Dogwood gave us an estimate about $2k less for surgery. I’m so glad we transferred!! Dr. Stan has been amazing. He explained everything very thoroughly, did a great job with surgery, and followed up with us multiple times while our dog was staying with them. The front desk staff was also very nice and helpful! Would highly recommend this vet!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Q8cBGmmN4C_zZM_v46Ss1kELUTSE-1Bbom2J5kcR8=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Abby R",
        "rating": "Rated 5.0 out of 5,",
        "review": "Great workers, amazing doctors… you can tell they truly care about the animals!!! Please don’t waste time trying to call around to make an appointment for an emergency with your furry family member at a general clinic! Just pull into the Dogwood parking lot, and walk right inside. They are so very quick. They always immediately check the animal to see if the case needs to be handled at that very moment!! Wait times can be decently long sometimes… But it IS an ER… But if your pet needs care URGENTLY they immediately take the pet into the treatment area! Thank you for opening this hospital here in Marietta! We really needed it!!!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxY1jmuZrq5pIF-n1bjghIjJ9KcNesrPUe8nJi3n=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Beverly Poole",
        "rating": "Rated 5.0 out of 5,",
        "review": "I went to Dogwood Vet Cĺinic with my sweet Daisy. Even though my visit didn't end ĺike I wanted it to the staff there were wonderful.  Dr.Sun diagnosed my Daisy with a disease that could not be helped.\nDr. Sun was so kind, compasionate and supportive during the whole process of me having to make a life altering decision.\nI would recommend Dogwood Vet Clinic to anyone needing an emergency vet. They are an incredible team.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZE1a6Pq8sytqeGRgz0jvPEry-4PEEBwrBbcN6Z=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "bigjim41",
        "rating": "Rated 5.0 out of 5,",
        "review": "Wonderful place with a truly caring staff. We took the dog there with severe internal problems and after tests and x-rays and an overnight stay it was determined that the prognosis was not good for recovery. All taken into consideration we had him put down.\nDid not want to have to do that but there were no other options.\nThey did a wonderful job in making him and us comfortable.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5SdjgS6odY2P-0hLiYqdcWceeqYj0dAhXDb4hHNSQ=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Erin Ivey",
        "rating": "Rated 5.0 out of 5,",
        "review": "I can’t recommend this hospital enough! Dr. Shih and staff effectively saved my German Shepherd’s life after a bout of seizures and scary neurological symptoms. They cared for him around the clock and we cannot thank the care team enough for getting him home alive and healthy. All of the staff here is wonderful and we feel so lucky to have Dogwood!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5S07f_jumBHNU5LjimsfP4sPqn_V7weBZUOKTHDDQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Kelly Becker",
        "rating": "Rated 5.0 out of 5,",
        "review": "If there were more stars I (and my dog!) would give them all!  When my dog stopped eating and I got a misdiagnosis from my regular vet, I tearfully went to Dogwood.  They treated me and my dog like we were the most important people that had walked in there.  Dr. Shih was kind, gentle, and kept us posted all along the way.  I would never hesitate to go there if we needed them again.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbu1GOjtlH20sYAYScbp4Nh0Paio4SXmRmIHXcC=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Ivy Li",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr. Shih and his staff very attentive and caring, they treated our dog with utmost care.  Their facility is well equipped, they even have an incubator for new born pets and a CT Scan machine to diagnose older dogs. I recommend their services.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaVT7WOHtEPoMHz5nRB-7pn5nBjty6-YkN8CHOD=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Imani Anderson",
        "rating": "Rated 5.0 out of 5,",
        "review": "The staff here is amazing! I brought my cat here because he wasn't able to pee. They were able to clear the blockage in his urinary tract and I had him back at home within 2 days. Everyone who works here is really pleasant and they are very professional. I can't recommend them enough!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RamoUtQgkRzh9VUA1PYFoIjThaXKpx5DHJj2CfnA=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Travis Jones",
        "rating": "Rated 5.0 out of 5,",
        "review": "We had a feral cat at our office that was very sick and in pain. We have never been able to get within 10’ of this cat but today she was feeling so bad she allowed us to pick her up and try to found some help for her. We were turned away by two local vets in Smyrna before we found Dogwood. The staff and Dr. Sun were awesome and showed great compassion for this stray.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZ1LnK77frkW7OQ3tSZlEQ2sEsYYuiRkplfXkcy=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Diana",
        "rating": "Rated 5.0 out of 5,",
        "review": "My sister and I had to take her cat here this past week.  Everyone we spoke to was so kind, helpful and knowledgeable.  I highly recommend this facility if you need to take your pet for emergency attention.  They are wonderful.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbvcnN_pRbIT3kg2JB8zlFHIwFHrXEsBz78yIFa=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Amanda Sussenbach",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr. Stan and I met today, and I was totally floored by the experience. Last week, my precious pup was diagnosed with osteosarcoma. Since then, I've taken my boy to multiple vets trying to soak in every possible fact about what we are facing and any potential treatment available. By the time I set an appointment with Dr. Stan, my head was already spinning. But when we met, he kept me grounded, gave me all scenarios out there, and never made me feel rushed in the process. He really helped me understand the big picture of a very complicated situation. Dr. Stan is extremely knowledgeable and genuinely wants to help, I can't recommend him enough. I'm thankful our paths crossed today.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QB7hwrikQAPuuawnegvjnddKMuqE2X2t-TYQ5Q=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Sam McWhorter",
        "rating": "Rated 5.0 out of 5,",
        "review": "I don't typically write reviews but Dr. Shih was absolutely fantastic while taking care of Bailey. He breaks things down into very clear and conscience options and gives you confidence in his methods. I know if there's another emergency I can come back here to see Dr. Shih and be in very good hands. I highly recommend Dogwood Veterinary Specialty and Emergency!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5SEHpIfxYB5elbLVWzfg-3LQAzMCm0mHGyVnbO4dw=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Katie Dawson",
        "rating": "Rated 5.0 out of 5,",
        "review": "We first saw Dr. Shih with our dog, Fergie, when he was practicing Critical Care in Jacksonville, Florida. Dr. Shih was so incredibly caring, intelligent, creative, and all around fantastic during Fergie’s treatment! So much so that when our other dog, Heidi, started showing signs of a serious mystery illness a few years later, we tracked him down to get his expert opinion. We’ve had pets all our lives, and we’ve had some wonderful veterinarians, but we’ve never trusted anyone as much as we trust Dr. Shih. Truly an amazing vet, and an amazing human! Thank you, Dr. Shih!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaZhIcgPqNCyTs1IcHQI3C3GDnfwxpcZic-8IlH=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "CAROLYN FRANCESCHI",
        "rating": "Rated 5.0 out of 5,",
        "review": "An amazing practice of caring and kind professionals!!  Drs. Tamassia and Maddox took such gentle and compassionate care of my best feline friend.  From the moment we entered we were treated with incredible kindness.   Should your furry family members need specialty or immediate emergency care, take them to Dogwood Veterinary Specialty and Emergency - they will be treated by the best!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbTZi_73oP_4XUSh3ACqEZXYuM8QcOkzoU3QkNd=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "It’s Bright",
        "rating": "Rated 5.0 out of 5,",
        "review": "My dog ingested poison last month and this emergency clinic is very attentive, open 24 hours, professional, sympathetic, and has a very clean facility. They broke down their invoice, and made things fit my budget considering how expensive it could have been. My dog is doing a lot better thanks to them.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RcViK93o3nD2p6IGF0ouLeNNgdT533obWdkTa1ZEE=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Jessica Hurrell",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dogwood is the best emergency vet I have ever been to!\n\nMy baby Milo had an IVDD flare up the night before Thanksgiving causing his back legs to become paralyzed and we didn't know where to go. Our vet recommended going here and I am so glad we did. The office is very clean and the front desk staff is very friendly. Within 15 minutes of arriving the nurse had talked to us and taken Milo back for his exam. Dr. Shih came into the room and actually sat on the floor and explained everything to us in great detail. He answered all of our questions and never made us feel rushed. He was so attentive and made us feel like he genuinely cared about our baby. I have never had an emergency vet or a primary vet take the time to talk to us like Dr. Shih did. They kept Milo overnight to monitor him and even talked to me in the middle of the night to keep me updated on Milo. The next day (Thanksgiving Day) Dr. Shih sat with us again and talked us through all of our treatment options. He even let us schedule a follow up with him a week later to recheck Milo and monitor his progress. If you ever find yourself in the need of an emergency vet I highly recommend Dogwood! They genuinely care about your pet and are very knowledgable!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYmQJvlw67WdES4OfyikQWmf8PqDXiiFijGHRHC=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Troy Smith",
        "rating": "Rated 5.0 out of 5,",
        "review": "They do a great job, are very professional, and communication is great. They are extremely expensive though. That isn't a surprise given that they are an emergency vet clinic. I wouldn't hesitate bringing my dogs to them if I am ever faced with an emergency again. They did what I paid for.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxY9dBuuEuPcXFFUzyeDuwWXkoolgUEd399XBBue=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Tammy Sims",
        "rating": "Rated 5.0 out of 5,",
        "review": "I cannot say enough wonderful things about this hospital. I took my 7 wk old 3 lb yorkiepoo to them in an emergency situation.  She was seizing and on her way to doggy heaven!  They rushed her back and begin saving her life immediately.  I was a wreck. The staff was so understanding, caring and loving to me and my fur baby. When it was all said and done they saved her life. It cost me an arm and a leg, but being the wonderful people they are, Dr. SHIH along with his office manager, gave me a discount and I was able to come up with the money. Please note: This is an EMERGENCY facility.  And it charges like an emergency facility, however, when it comes to an emergency situation, it's like taking your baby to EMORY HEALTHCARE.  The best in the business!  I recommend them 3000%.  Keep up the great work Dogwood!  You guys are amazing and Dasey says hello❤🖤❤🖤❤!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TBvb9aIi5HGDBwMXG55apN21UuR_jqHosyAnIJ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Marco",
        "rating": "Rated 5.0 out of 5,",
        "review": "My cat was seem promptly and the staff was great. Nice facility, reasonably priced for emergencies.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TMVy3w5DhIjAkL4A1uGWPG5Qa0WDqbmgfPOzLgPw=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Bonnie Dixon",
        "rating": "Rated 5.0 out of 5,",
        "review": "If you are looking for a wonderful animal clinic you have found it !!! I was so sure my Sadie was not going to make it and I took her here and met the most wonderful and compassionate staff and doctor . She was operated on immediately and though she may not be \"home free\" at least they were very optimistic and she has a shot !!  Thank you Dr. Shih and staff !!!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxb8e--gPP-mQ8oqBZ6aTF6nibdJXddPSWWk6V0=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Gabriel G",
        "rating": "Rated 5.0 out of 5,",
        "review": "Really great place. They saved my cat from an infection. It really sucks there are so few vets bc that means high costs for the client. Nothing against them, just an observation of the industry. I will say Dr Shih did his best to not charge me more than necessary, and even lumped in a few charges so it wouldn't cost me as much. As for Oreo, she's doing a lot better after just a few days, eating food and drinking water, and wanting to play even though she can't. They use CareCredit and Scratchpay, but unless it's immediate surgery, it likely won't cost that much to even need those credit services. Also, compared to places like BluePearl and cobb Cherokee emergency vet clinic (bought out by blue pearl), the cost was much lower, as those places would cost 2k or higher.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TJj7vKtMq1galCiYpibvGZvpbWMxVPPMgdYtzlPA=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Steven Murray",
        "rating": "Rated 5.0 out of 5,",
        "review": "They saved my dogs life! Seriously the best in the business and their staff is incredible! Thanks for taking care of my Gigi!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbul1HgN8SEM1Wu8jUFm_cakhGMQHRsKUUH6MFv=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Cara Powell",
        "rating": "Rated 5.0 out of 5,",
        "review": "We had a terrible experience taking our very sick dog to Dogwood ER. She was suspected to have bloat, we took her to Dogwood at 4pm, she ended up spending the night there. They ran multiple sets of X-Rays and were adamant that her stomach had not flipped. The following morning they told us she was \"stable\" but reported she had not really improved. We requested they send her X-Rays to other outside vet/ER hospitals so we could start getting second opinions. I immediately received calls from both vets saying \"your dogs stomach has flipped get her here immediately for surgery!\" We then called Dogwood back, told them what the other vets had relayed to us, and let them know we would be picking our dog up shortly. Upon arriving the vet told us \"We just ran another set of x-rays and we can confirm that her stomach has not flipped\". They were insistent. Our dog walked out looking like she was near death. We sped to the other veterinarian, as she was moaning in pain the entire car ride. He immediately preformed surgery, and her stomach had completely flipped, and tangled with her spleen. Her stomach was blue from loss of oxygen/blood supply. He was able to save her, but did say that she would not have made it another 2-3hr. This practice is very new, and clearly the vets attending to our dog did not have the necessary experience. I would NOT take my dog here for any serious illness.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaLHUchO__x-UJGRcmSa8_eyzfTk6FewjEDENeW=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "cwedge",
        "rating": "Rated 5.0 out of 5,",
        "review": "I brought my beloved collie emergently for a sudden discovery of a splenic mass bleeding into her abdomen. It was by far the worst day of my life, but Dr. Shih… I can’t even describe how compassionate, thoughtful, thorough, and patient this angel of a physician was with me. Even with the worst possible diagnosis with a dismal prognosis, he proceeded to try and save her. He and his staff did absolutely everything they could, and ultimately she did not make it. However, I could never have imagined that the worst day of my life would be supported as much by not only Dr. Shih, but his surgical staff and the lovely front desk ladies. I was alone at the clinic grieving, and they all came into the room to comfort me throughout the night. I have never seen this level of care not only for my baby but for me. Dr. Shih, thank you so much. You have a very special place in heaven, and you’ll always have a special place in my heart.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxb0v08brB1ZNKo79UVA3O7MGTZISi90qvfvmg6n=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Ben Sharenko",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr. Shih and his team treated my cat Gus and nursed him back to health. Dr. Shih communicated my cat's issues very clearly and patiently answered all my questions. It was a very stressful few days for our family and Gus, but thanks to Dogwood and Dr. Shih, out cat Gus is still with us. 5 stars.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaCriHyekOwm0K299BtnXVht-V7LpL4WDglByzD=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Mr. Beacher",
        "rating": "Rated 1.0 out of 5,",
        "review": "Passing through the area when our dog had an emergency. They were professional, able to rule out life threatening issues, and got her taken care of so we could finish our trip. Nursing our little girl back to health now but would have been stuck in Atlanta if it weren't for Dogwood",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxb3jrCxglErZt_mybSst5AsAObghoFnEFo6iZFn=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Jennifer Z",
        "rating": "Rated 5.0 out of 5,",
        "review": "Best emergency clinic in Atlanta. Extremely thorough &amp; clearly want the very best for your baby. Dr. Wyatt is so passionate &amp; treats your pets like her own. I am so thankful for Dr. Wyatt!!!!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QFo4dCpAZMMojppboVfy85rMIBCUoU6GNUukVF9g=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Amber Kelley",
        "rating": "Rated 5.0 out of 5,",
        "review": "I had a horrific experience at this facility. I was first advised to call animal poison control to begin a case number and they would also be helping the emergency vet on a plan of care. I was charged 75 dollars for a 5min consultation. I care about my cat so fine. I take my cat to Dogwood vet specialty, and they don’t follow the advised plan and do other various tests which added up to almost 4,000. When I inquired why was I advised to seek help via charged phone consultation, Dr. Wyatt became defensive and simply said because she is the doctor and the animal poison control sit behind computers. Again, why was I advised to pay another facility and then charged thousands of dollars because they do whatever testing they feel is necessary??? They only want money. I beg you all beware!\nThe cherry on top was when I asked Dr. Wyatt why she was doing extra testing that was not deemed necessary by animal poison control she threatened me to come pick up my cat after crying hysterically finding a line of credit for my cats care! Thanks Wyatt",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbPU6qdEZQ7ZtqnmFoZKDOIUXXsI0wfxwy8L3qi=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Kaleigh Tjoelker",
        "rating": "Rated 5.0 out of 5,",
        "review": "Cat was taken back right away on a Saturday. We did have to wait ~2 hours but we had an exam room to wait in. Very nice, clean facility. I appreciate that they did not want to perform any unnecessary tests or labs.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Ql3JXFxi6_frjAOSRVCBn38lp8bFV__20wtneaug=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "cn j",
        "rating": "Rated 5.0 out of 5,",
        "review": "Took me a long time to find time to write this, but I wanted to thank everyone at Dogwood for their care of our fur baby. Fantastic staff, fantastic treatment.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaRQtFE2iC5v_gQX0YolXEo8jerJnxar_LGaU_L=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Rob Fowler",
        "rating": "Rated 1.0 out of 5,",
        "review": "Although a fairly new emergency vet, I'm really happy with how they took care of my cat when she was in need.  Will definitely bring her back if needed",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZmiA6k3bb4-82IdVHg3BT_LeNl8jq9-tY_UQdN=s40-c-c0x00000000-cc-rp-mo-ba5-br100"
    },
    {
        "username": "Pauline Wright Zagame",
        "rating": "Rated 4.0 out of 5,",
        "review": "Our puppy seemed near death this morning. Our regular vet did what they could, but she was not improving so they sent us to Dogwood. Dr. Shih suspected an unknown toxin. They kept her and treated her for 4 hours and when we picked her up she was back to her old self. Dr. Shih and his pleasant staff are AMAZING. I can’t thank them or praise them enough!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Shz9eX8824UMyS3SMDfS--foe1wAKNh2_XLLPZLQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Nathan Queen",
        "rating": "Rated 5.0 out of 5,",
        "review": "Folks, if you care about your family member, take them to Dogwood immediately. After being turned away by several clinics and universities, we somehow found Dr Shih and his team. We drove three hours from WNC and were greeted and immediately seen by Dr Shih and his team. I have not met a more knowledgeable and caring veterinarian in my life. My sweet Wylma received the best care she could have in the best hands. She is on the mend and doing great! I can never thank Dr Shih enough.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbcyAfcfB_QKBgBcz38Pq7CYcACuLHUydp_4_Ad=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "tiziana rodriguez",
        "rating": "Rated 5.0 out of 5,",
        "review": "Caring and nice unfortunately could not help me with my fur kid because they are very new and didn’t have the necessary equipment. However vets are nice and staff as well . Highly recommend.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Qurkukj-HssFufG-nkHKzZWKQ_O7b703Dd6Rvw6A=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Noah Russell",
        "rating": "Rated 5.0 out of 5,",
        "review": "Great facility that helped my golden retriever in need. They were very professional and I have the peace of mind knowing that my buddy is okay again!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5R0XwojdHbj_xrb2GRps1gWfFP7Q0R8fUgsQIoTrg=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Shannon Wright",
        "rating": "Rated 5.0 out of 5,",
        "review": "We have nothing but good things to say about Dr. Shih and the staff here at dogwood. They were extremely helpful and kind during our emergency. Many thanks!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5R5weDpT1tdgRuITFPwQ9fM-f2IOFouMdEO5ivgmA=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Dominic Aurino",
        "rating": "Rated 4.0 out of 5,",
        "review": "The only option in Atlanta if your pup is a family member.  Love the staff and how they cherished our Lola.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZbKv9dfFqtrmJIPCvxzMjwdUQJSslGDh63ggLH=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "Cindy Oldham",
        "rating": "Rated 5.0 out of 5,",
        "review": "Fantastic staff and fair pricing.  Understanding of my dog’s medical problems and coming up with new medication to help her feel better.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbeav9XXtWnUEYHn5TVGH0bp4QTWnauTQDo57Lu=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Barbara Barwick",
        "rating": "Rated 5.0 out of 5,",
        "review": "Wonderful people and made it easier to put down my cat, thank you all for your support and help",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbnz1_8gDedvDKo7_s8nT6eDA5YuNnANGvBG5f5=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Greg Crenshaw",
        "rating": "Rated 5.0 out of 5,",
        "review": "Horrible!  Thought my dog had been bitten by a snake. Only one other patient in the office.  After well over an hour I walked out. If you have an emergency do not take your pet to this location!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QJ-_jru5UYwiMB1CAaJ5060k4L3es9OyrXUIcQqQ=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Jared Moore",
        "rating": "Rated 5.0 out of 5,",
        "review": "“Come back to get the stitches removed it‘ll only take 10 minutes”\n\nWell yeah after waiting an hour and a half it only took 10 minutes. Set expectations right from the beginning and it’ll be a much better experience",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TMXF7b4_sA7x63VhqOea_P1vUGBVS9pyy5IoD3_w=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "Heather Swihart",
        "rating": "Rated 5.0 out of 5,",
        "review": "Expensive but great staff and great care.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QXXimpX4PH1Ah2Vtad3f1PAAT89IAvkgWsjQdnuQ=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "coach felix",
        "rating": "Rated 1.0 out of 5,",
        "review": "I'm so excited to have the incredible Dr. Agda as my vet!\nShe's so knowledgeable and cares so much about all her patients. I know my pets are in great hands with her!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5S5o1SxW3LLotsbXbCprr67eWbVHvHYFkx69vQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Carigan Davis",
        "rating": "Rated 1.0 out of 5,",
        "review": "Nice new clinic. Kind doctors and staff. Zai was my technician, and she was very nice.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QBIgg-My08fQE6P3z8NJzd_FIAfEg8BMLB00s1hw=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "gale gallager",
        "rating": "Rated 5.0 out of 5,",
        "review": "Front desk/reception ladies were extremely nice. Cannot say about services as I was only retrieving our carrier.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaJHgoiS214KUvrEASAVSqL3Kwf9qx6UKfj60-_=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Kirk Kimmerling DDS",
        "rating": "Rated 5.0 out of 5,",
        "review": "Thank you for helping us with Jojo Saturday! See you tomorrow for a bandage change! She is doing great!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QponnrqCvhY_heqgeE6ovq-DsKM5XHENQukZa4sA=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Denny Reece",
        "rating": "Rated 5.0 out of 5,",
        "review": "Very caring group of professionals. From the moment I walked through the door every employee was attentive, respectful and just honesty nice.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxabun7zmDX39hKl2K4kT2eYgD8d3jU2RGuYM4gr=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Gregg Ledbettr",
        "rating": "Rated 5.0 out of 5,",
        "review": "Great vets and very comfortable environment when in need of emergency  vet  services",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZSbFZ7vEBJnE-I5fdPcpnAQqU2LbAg1s7tUSuE=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Bianca Tamassia",
        "rating": "Rated 5.0 out of 5,",
        "review": "Best clinic ever my cat broke her leg we took her to Dogwood and in a week she is was walking!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QLFlOlzzTRwPmmvLHBtiHtceXHmf8qDS5R-Fma=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Klibs Galvao",
        "rating": "Rated 5.0 out of 5,",
        "review": "Great service, friendly staff, and amazing vets.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZrO9bbrmq47cL_vy43bHndSXkA2FRNAB8goOre=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Vanessa Ferraz",
        "rating": "Rated 5.0 out of 5,",
        "review": "State of the art facility with the most caring team and super dedicated vets!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5S3ytXuI9XIpu_zHNwXUOkyPbbfpI68UpzeYZfW=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Patricia de Queiroz-Williams",
        "rating": "Rated 5.0 out of 5,",
        "review": "I am very impressed with Dogwood veterinarians. All high level knowledgeable and well respected in their area of specialty",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TRS6Wxygyoh7ozTc_uAkVuXxuS9NQ-ynLEvUarfQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Phil Hossler",
        "rating": "Rated 5.0 out of 5,",
        "review": "Beautiful offices and very friendly and professional staff",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TIdGsLIPVqQUinyK-0NUXAmXlK7LSwGl_T9dZMig=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Brandon Lawson",
        "rating": "Rated 5.0 out of 5,",
        "review": "Nice staff. Receptionist was cute",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QHEYuEFvmWtv7OtKBOPvC5uAvuHOlkBOvFexCF=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Sue Everhart",
        "rating": "Rated 5.0 out of 5,",
        "review": "Much needed, a caring place for our fur babies",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaDSMbZLFvkiUStKJ5h_AAwiUZR7Fm911gWb2R6=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Raiane Araujo",
        "rating": "Rated 5.0 out of 5,",
        "review": "I have known  Dr Shih for a long time and he is a very competent veterinarian !!!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbNfzJMPTssxJ9M2Bvr7jOdCK6mdYhiUjCUkjJQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "James Knox",
        "rating": "Rated 5.0 out of 5,",
        "review": "Great staff and excellent facility",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QtbdN_dtRLAct6cdQiNTv6jrH34LrIB41wgruw=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Mike Finch",
        "rating": "Rated 5.0 out of 5,",
        "review": "Vets were kind and knowledgeable.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Q3d0nJ3tQJroyO5Chw5NdhDHj0MIeUY9UETOGA=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Caroline Brady",
        "rating": "Rated 5.0 out of 5,",
        "review": "Literally saved my dogs life this weekend.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RmSi3M5tG8wx7JxU8qpszZNpdoSy4IM8DttVh_wHE=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Juggalo Joe",
        "rating": "Rated 5.0 out of 5,",
        "review": "Very quick service very friendly staff",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbT82Av4qfssiILHWLSKIBGGJT-KWP6ThobVocR=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Tatiana Azevedo",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr Shih is very compassionate and a great veterinarian",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYXv7wB018JGKXHaz0bhPSijfZdn3jnLg1U5ctR=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Melissa O'Brien",
        "rating": "Rated 5.0 out of 5,",
        "review": "Helped me with my cat in an emergency.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Qd-7tMfiiCaRoTqxCyZLxp2LnHoZ_LrWbjauf3Ew=s40-c-c0x00000000-cc-rp-mo-ba3-br100"
    },
    {
        "username": "Kallina Matos",
        "rating": "Rated 5.0 out of 5,",
        "review": "Excellent veterinarian, excellent teacher. An honor to know you.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYfqSdglV2W8hwC0PPTIisK3qVN_kAsM_x58gg=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "shane cochran",
        "rating": "Rated 5.0 out of 5,",
        "review": "Very caring at a hard time",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TGijTEtDtitlzMc-CyScwOOMQubHXCGafgnCRqPw=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Jason Williamson",
        "rating": "Rated 5.0 out of 5,",
        "review": "Great 24hr vet!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZfa6Qfw5Yyolc74aZ-jdQB4Rg6uTv6miE25p--=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Elaine Liporage",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr Shih is a excellent veterinary!!!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZd_HYNgCin7yRAN6ZR3Q0935Vk4Ir5av4g3yMo=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "LÌLIA CITARELLA",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr.Shih is an excellent professional!!!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZnc24uBeGbt5djJATHOrqMQn8LYq2sAZ679BZR=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Lucas Pasquini",
        "rating": "Rated 5.0 out of 5,",
        "review": "Very good service",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TgRckaD6qBQZfW2jnvDHPDvyAryCgZDNoZL30Cxg=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Mariana Rodrigues",
        "rating": "Rated 5.0 out of 5,",
        "review": "Great veterinarian!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYZFEnsjGTQQwq5awkeTBg4vm-s5DBbuTcJuHlJ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Michael",
        "rating": "Rated 5.0 out of 5,",
        "review": "Amid a really distressing night for our dog (and a concerning one enough for us to go here at 1am), the staff were super kind, fast-moving, and the place itself was super well-lit with locking doors for extra safety.\n\nOur dog turned around almost immediately after they intervened, and it all occurred for a relatively reasonable price given this was immediate and at 1 in the morning (frankly, this wasn’t much more expensive than paces ferry vet for a normal, day-time checkup…).\n\nThe next time something happens with our dog that requires immediate attention, especially during off hours, we will probably be coming back here.\n\nThank you, team!! You all were great",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RG4yyKi7Aq_rObpNqLm82u7HkR1QXue5lpl2EfTg=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Lauren Green",
        "rating": "Rated 5.0 out of 5,",
        "review": "This place is fantastic! I brought my cat in to them for an emergency when my vet was closed and Dr. Wyatt and the support staff were so kind and helpful. I would highly recommend this hospital for pet emergencies.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxaTUBG1Hn5rHrAVhrLqDKc1ZP-0W_SXkRxWEDXH=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "María",
        "rating": "Rated 5.0 out of 5,",
        "review": "I went with my cat Panchita with a serious respiratory problem (the diagnosis was asthma).  The staff at the front desk were very kind and friendly. As soon as we arrived we met Dr Andre Shih, he was amazing, he kept me informed at all times, very kind, he made me feel confident and calm.  The place is very nice and very clean.  I am very grateful for the care we received.",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZF4vWcTQDKzNQqeBR8ukYcfBPcIu4Mmuv0Wjbk=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Brittany Bowsher",
        "rating": "Rated 5.0 out of 5,",
        "review": "Definitely recommend coming here! The receptionist, the techs and the doctor are really caring and nice! The place is also really clean!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RB3urELiyN1JE13U8bRckVWShU2OyMcW2PpkVSyQ=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Andrea Hobday Kidd",
        "rating": "Rated 5.0 out of 5,",
        "review": "Just a bad experience. I'm sure they are great for others but for me just not a good fit. I felt as if we were put in a room and there we sat waiting for well over an hour no one came into check on our dog WELL OVER an hour. We finally walked out and took her to Blue Pearl. 20 min away and was seen immediately no waiting at all. Turns out my dogs blood sugar was in the low 600's. Welcome to canine diabetics.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TgVDqnSUpQbBlE-QBZwpJL_LOq-va2F6oH34B-FQ=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Chris Morrison",
        "rating": "Rated 5.0 out of 5,",
        "review": "Brought our dog on a Sunday evening due to an injury. Received prompt, professional and friendly service at a very reasonable cost. Highly recommend!",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RE92zoYUWJiEhjcBmm7SHwCdawO7vB__pMaHpEOw=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Jake M",
        "rating": "Rated 5.0 out of 5,",
        "review": "We were attended to reasonably quick and the doctor made sure to spend plenty of time explaining everything about what was going on with our dog during our emergency visit at night. The facility is very nice and the staff was fantastic. I would highly recommend",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbhwCnGVVTNzWJ18ohcFwnnnSt8aU9WYPQDl-vnLQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Saylor Clark",
        "rating": "Rated 1.0 out of 5,",
        "review": "This place was exceptional with communicating what was going on. My cat was well taken care of and the workers were so kind. They did not have me waiting long at all. This place is awesome and I recommend to all who need their pet to be seen urgently",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RkdVOdQRYwLWyNYovenE9YcA4yr9M-pIm0RssIG6E=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "ML King",
        "rating": "Rated 5.0 out of 5,",
        "review": "Dr. Shih was amazing as was the entire staff. He took the time to explain everything well making sure we understood completely.  I don't think my cat would have made it without Dogwood.  Thank you!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYYjlkthmolYf3TXIpHPUzPHJuMD-1iH3Psvas=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Lindel Richardson",
        "rating": "Rated 5.0 out of 5,",
        "review": "I was so worried about my baby, my Chinx. After seeing how loved and well taken care of the staff was with my dog, my anxiety went away. The cleanliness of the facility. The doctor is amazing. The staff is amazing. THANK YOU SO MUCH.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5T3MJ7h43ES9caRiaAUIwxt0xAEM3jqqHs1URskOA=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Brian McKenzie",
        "rating": "Rated 5.0 out of 5,",
        "review": "Amazing service and compassion",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TYZ9v0ufEKHqzDMvzszaBnu_55T3ecofcH_U_oxQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Danielle Sweeney",
        "rating": "Rated 5.0 out of 5,",
        "review": "Excellent care! Highly recommend this emergency animal hospital. I learned more about my dog's chronic condition and how to address it than I have in 8 years of other vets across 2 states! Very caring and skilled staff and reasonably priced.",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Q1UlWvu36R4CkT5yQpI5NspdkMnWolURs_GltCJA=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "yaya rillos",
        "rating": "Rated 5.0 out of 5,",
        "review": "(Translated by Google) Very good class and with a lot of content! Awesome teacher teaching!\n\n(Original)\nAula muito boa e com bastante conteúdo! Didática do professor sensacional!",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxa9FkLZxNadNY-HG0qfCxk2BOzs8GIiMcug1RbK=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Keznia Smoak",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5SWDgPYYl61cLaCKtkMufEScC1zmpEXnmW-nX_A_Q=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Kelly Hargus",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZ5kp1Y4Zb_ORFfmShROz2G6WbYcwgKTEmYDi18=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Melinda Batton",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxarcJ-07hwWFwSD3FU6WG_F9-vy5E4tpV0fyXB8mg=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "daisy southerland",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5SrUo_aWJISJ26Fm-OcBtDZhlyhu1vJsvavBWdvNw=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Johnny Collins",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5TuehaIVpV80K-QT1RsKFVYx_fV6Z8jOO6ehNkbSDw=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "C Cleveland",
        "rating": "Rated 1.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZWRWXjzgDFHQ3B68yIrTLasrA23yLA4Yk2e747=s40-c-c0x00000000-cc-rp-mo-ba2-br100"
    },
    {
        "username": "Ernest Crosby",
        "rating": "Rated 3.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbph2I0orYe0eLvuyfWyxZ9UHLWbAVz5wcfsX4B=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Thayse Machado",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYZDqTVp6X-2IL9w6tzbR31jxy-nc23qrhfXWTg=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Richard Prophete",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYqn2Ax1WVzAkGLXA0PtEf_KVYVruR_Y3km4Dkd=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "W H",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxZdUvDMQNyCPbcJTFScgoNYGx6GuYXUr4d-t4CQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Brianna Michelle",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RHIXdn1j2PBHMpaGrAasuNO7FdmNepbVcPhxK-fg=s40-c-c0x00000000-cc-rp-mo-ba4-br100"
    },
    {
        "username": "Magna Periard",
        "rating": "Rated 4.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5QmHSbFeLoUUcv7HC1iRLXjiGWp_KZAsgIHFuOuwfo=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "janine kurkowski",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5SDOZwZ3rUiapw7o8BX1qNpF2Rwtl2KffgKhSl3PA=s40-c-c0x00000000-cc-rp-mo-ba6-br100"
    },
    {
        "username": "cristiane machado",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxYj9XZIiI3Uem0UiAYCRfaB3O9ol1wM6_3DoATn=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Otis Elgato",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5SYw4jj59dYxo7mssyaEc-wYJdzJQOqOLTrZiB1Vg=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Rigoberto Cortes",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Sl0S4_8cQfD8FL0M0XIXYgLmld4qTgW0eCUyJwLQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Lauren Rea",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a/AGNmyxbMLjaS744cQaQ2wKUYoQXCbmREmnkDGDFlfbBK=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Juliana Freire de Carvalho Ju",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5Ri8bu5nTGBBCT-58pQWbdJS6Ip6DbD2o583okMKQ=s40-c-c0x00000000-cc-rp-mo-br100"
    },
    {
        "username": "Bob Vincent",
        "rating": "Rated 5.0 out of 5,",
        "review": "",
        "profilePic": "https://lh3.googleusercontent.com/a-/ACB-R5RoJERoGNp6QQ3c-ThPlfx4oy_r-xc_Jtibc_ektg=s40-c-c0x00000000-cc-rp-mo-br100"
    }
]